# SetRodLength Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricationRodInfo..::..SetRodLength Method
FabricationRodInfo Class See Also
---
Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool SetRodLength(
	int rodIndex,
	double newLength
)
```

Visual Basic
---
```text
Public Function SetRodLength ( _
	rodIndex As Integer, _
	newLength As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool SetRodLength(
	int rodIndex,
	double newLength
)
```

# ### Parameters
rodIndex
    Type: System..::..Int32 The rod index.
newLength
    Type: System..::..Double
# ### Return Value
returns true if it worked.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The rod length cannot be set because the hanger is set to automatically host to other elements. |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace